       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULOAREAS.
    
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77  BASE      PIC 9(3).
       77  ALTURA    PIC 9(3).
       77  LADO      PIC 9(3).
       77  RESULTADO PIC 9(6) VALUE ZEROS.

       PROCEDURE DIVISION.
           DISPLAY "BASE: " LINE 10 POSITION 21 ERASE.
           ACCEPT BASE LINE 10 POSITION 27 PROMPT.
           DISPLAY "ALTURA: " LINE 12 POSITION 21.
           ACCEPT ALTURA LINE 12 POSITION 29.
           DISPLAY "LADO: " LINE 14 POSITION 21.
           ACCEPT LADO LINE 14 POSITION 27.

           IF LADO = 0 GO TO AREA1 ELSE GO TO AREA2

           STOP RUN.
       AREA1
               MULTIPLY BASE BY ALTURA GIVING RESULTADO
               DISPLAY "RESULTADO POLIGONO: " LINE 16 POSITION 21
               DISPLAY RESULTADO LINE 16 POSITION 42
           STOP RUN.
       AREA2
               MULTIPLY BASE BY ALTURA GIVING RESULTADO
               DIVIDE 2 INTO  RESULTADO
               DISPLAY "RESULTADO TRIANGULO: " LINE 16 POSITION 21
               DISPLAY RESULTADO LINE 16 POSITION 42

           STOP RUN.